datos.txt

show dbs;

use touresbalon;

db.createCollection('providers');

db.providers.insert({
      'name': 'AVIANCA',
      'type': 'FLIGHTS',
      'integrationType': 'SOAP',
      'settings': {
        'request': {
          'parameters': {
            'methods': {
              'catalogue': {
                'endpoint': 'http://192.168.1.100:8888/TuresBalonProviders-Avianca-context-root/ServicioAviancaVuelosSoapHttpPort',
                'Action': 'http://servicios.avianca.com/types/consultarVuelo',
                'EnvelopeRequest': '<soapenv:Envelope xmlns:soapenv="http: //schemas.xmlsoap.org/soap/envelope/" xmlns:typ="http://servicios.avianca.com/types/"><soapenv:Header/><soapenv:Body><typ:consultarVueloElement><typ:ciudadOrigen>@ciudadOrigen</typ:ciudadOrigen><typ:ciudadDestino>@ciudadDestino</typ:ciudadDestino><typ:fechaSalida>@fechaSalida</typ:fechaSalida><typ:clase>@clase</typ:clase></typ:consultarVueloElement></soapenv:Body></soapenv:Envelope>',
                'NullableParams': [
                '@ciudadOrigen',
                '@ciudadDestino',
                '@fechaSalida',
                '@clase'
              ],
                'MandatoryParams': null,
                'RelationConstrain': {
                  '@clase': {
                    'Eje': 'EJECUTIVO',
                    'Pcl': 'PRIMERA CLASE',
                    'Bar': 'BARATO'
                  }
                }
              },
              'reserve': {
                'endpoint': 'http://192.168.1.100:8888/TuresBalonProviders-Avianca-context-root/ServicioAviancaVuelosSoapHttpPort',
                'Action': 'http://servicios.avianca.com/types/reservarVuelo',
                'EnvelopeRequest': '<soapenv:Envelope xmlns:soapenv="http: //schemas.xmlsoap.org/soap/envelope/" xmlns:typ="http://servicios.avianca.com/types/"><soapenv:Header/><soapenv:Body><typ:reservarVueloElement><typ:vuelo><typ:fechaSalida>@fechaSalida</typ:fechaSalida><typ:fechaLlegada>@fechaLlegada</typ:fechaLlegada><typ:ciudadOrigen>@ciudadOrigen</typ:ciudadOrigen><typ:vuelo>@vuelo</typ:vuelo><typ:clase>@clase</typ:clase><typ:ciudadDestino>@ciudadDestino</typ:ciudadDestino><typ:precio>@precio</typ:precio></typ:vuelo><typ:nombrePasajero>@nombrePasajero</typ:nombrePasajero><typ:numeroIdentidadPasajero>@numeroIdentidadPasajero</typ:numeroIdentidadPasajero></typ:reservarVueloElement></soapenv:Body></soapenv:Envelope>',
                'NullableParams': [
                '@fechaSalida',
                '@fechaLlegada',
                '@ciudadOrigen',
                '@vuelo',
                '@clase',
                '@ciudadDestino',
                '@precio',
                '@nombrePasajero',
                '@numeroIdentidadPasajero'
              ],
                'MandatoryParams': null,
                'RelationConstrain': {
                  '@clase': {
                    'Eje': 'EJECUTIVO',
                    'Pcl': 'PRIMERA CLASE',
                    'Bar': 'BARATO'
                  }
                }
              }
            }
          }
        },
        'response': {}
      }
    });

db.providers.insert({
      'name': 'AA FLIGHTS',
      'type': 'FLIGHTS',
      'integrationType': 'SOAP',
      'settings': {
        'request': {
          'parameters': {
            'methods': {
              'catalogue': {
                'endpoint': 'http://192.168.1.100:8888/TuresBalonProviders-AA-context-root/AAFlightsServiceSoapHttpPort',
                'Action': 'http://services.aa.com/types/searchFlight',
                'EnvelopeRequest': '<soapenv:Envelope xmlns:soapenv="http: //schemas.xmlsoap.org/soap/envelope/" xmlns:typ="http://services.aa.com/types/"><soapenv:Header/><soapenv:Body><typ:searchFlightElement><typ:departinCity>@departinCity</typ:departinCity><typ:arrivingCity>@arrivingCity</typ:arrivingCity><typ:departinDate>@departinDate</typ:departinDate><typ:cabin>@cabin</typ:cabin><typ:PromotionCode>@PromotionCode</typ:PromotionCode></typ:searchFlightElement></soapenv:Body></soapenv:Envelope>',
                'NullableParams': [
                '@departinCity',
                '@arrivingCity',
                '@departinDate',
                '@cabin',
                '@PromotionCode'
              ],
                'MandatoryParams': null
              },
              'reserve': {
                'endpoint': 'http://192.168.1.100:8888/TuresBalonProviders-AA-context-root/AAFlightsServiceSoapHttpPort',
                'Action': 'http://services.aa.com/types/bookFligth',
                'EnvelopeRequest': '<soapenv:Envelope xmlns:soapenv="http: //schemas.xmlsoap.org/soap/envelope/" xmlns:typ="http://services.aa.com/types/"><soapenv:Header/><soapenv:Body><typ:bookFligthElement><typ:f><typ:cabin>@cabin</typ:cabin><typ:arrivingDate>@arrivingDate</typ:arrivingDate><typ:price>@price</typ:price><typ:arrivingCity>@arrivingCity</typ:arrivingCity><typ:meals>@meals</typ:meals><typ:departinDate>@departinDate</typ:departinDate><typ:departinCity>@departinCity</typ:departinCity><typ:number>@number</typ:number></typ:f><typ:passengerName>@passengerName</typ:passengerName></typ:bookFligthElement></soapenv:Body></soapenv:Envelope>',
                'NullableParams': [
                '@cabin',
                '@arrivingDate',
                '@price',
                '@arrivingCity',
                '@meals',
                '@departinDate',
                '@departinCity',
                '@passengerName'
              ],
                'MandatoryParams': [
                  '@number'
                ],
                'RelationConstrain': {
                  '@cabin': {
                    'Eje': 'EJECUTIVO',
                    'Pcl': 'PRIMERA CLASE',
                    'Bar': 'BARATO'
                  }
                }
              }
            }
          }
        },
        'response': {}
      }
    });

db.providers.insert({
      'name': 'HILTON',
      'type': 'HOTEL',
      'integrationType': 'SOAP',
      'settings': {
        'request': {
          'parameters': {
            'methods': {
              'catalogue': {
                'endpoint': 'http://192.168.1.100:8888/TuresBalonProviders-HRS-context-root/HiltonRoomServiceSoapHttpPort',
                'Action': 'http://xmlns.oracle.com/HiltonRoomService/initiate',
                'EnvelopeRequest': '<soapenv:Envelope xmlns:soapenv="http: //schemas.xmlsoap.org/soap/envelope/" xmlns:hil="http://xmlns.oracle.com/HiltonRoomService"><soapenv:Header/><soapenv:Body><hil:HiltonRoomServiceProcessRequest><hil:City>@City</hil:City><hil:Country>@Country</hil:Country><hil:Check-In>@Check-In</hil:Check-In><hil:Check-Out>@Check-Out</hil:Check-Out><hil:Rooms>@Rooms</hil:Rooms><hil:Type>@Type</hil:Type></hil:HiltonRoomServiceProcessRequest></soapenv:Body></soapenv:Envelope>',
                'NullableParams': null,
                'MandatoryParams': [
      '@City',
      '@Country',
      '@Check-In',
      '@Check-Out',
      '@Rooms',
      '@Type'
    ],
    'RelationConstrain': {
      '@hotel': {
        'Eje': 'EJECUTIVO',
        'Pcl': 'PRIMERA CLASE',
        'Bar': 'BARATO'
      }
    }
    },
    'reserve': {
      'endpoint': 'http://192.168.1.100:8888/TuresBalonProviders-HiltonBookingService-context-root/HiltonBookingServiceSoapHttpPort',
      'Action': 'http://services.hilton.com/types/bookRoom',
      'EnvelopeRequest': '<soapenv:Envelope xmlns:soapenv="http: //schemas.xmlsoap.org/soap/envelope/" xmlns:typ="http://services.hilton.com/types/"><soapenv:Header/><soapenv:Body><typ:bookRoomElement><typ:r><typ:guestName>@guestName</typ:guestName><typ:roomNumber>@roomNumber</typ:roomNumber><typ:checkout>@checkout</typ:checkout><typ:hotel>@hotel</typ:hotel><typ:checkin>@checkin</typ:checkin></typ:r></typ:bookRoomElement></soapenv:Body></soapenv:Envelope>',
      'NullableParams': [
      '@guestName',
      '@roomNumber',
      '@checkout',
      '@hotel',
      '@checkin'
    ],
      'MandatoryParams': null,
      'RelationConstrain': {
        '@hotel': {
          'Eje': 'EJECUTIVO',
          'Pcl': 'PRIMERA CLASE',
          'Bar': 'BARATO'
        }
      }
    }
  }
  }
  },
    'response': {}
    }
  });

db.providers.insert({
      'name': 'TEST',
      'type': 'TEST',
      'integrationType': 'SOAP',
      'settings': {
        'request': {
          'parameters': {
            'methods': {
              'catalogue': {
                'endpoint': 'https://cvnet.cpd.ua.es/servicioweb/publicos/pub_gestdocente.asmx',
                'Action': 'http://UASI/WS_GESTDOCENTE.wsdl/wstitulosuni',
                'EnvelopeRequest': '<soapenv:Envelope xmlns:soapenv=\"http://schemas.xmlsoap.org/soap/envelope/\" xmlns:ws=\"http://UASI/WS_GESTDOCENTE.wsdl\"><soapenv:Header/><soapenv:Body><ws:wstitulosuni><!--Optional:--><ws:plengua>@plengua</ws:plengua><!--Optional:--><ws:pcurso>@pcurso</ws:pcurso></ws:wstitulosuni></soapenv:Body></soapenv:Envelope>',

                'NullableParams': null,
                'MandatoryParams': [
                  '@plengua',
                  '@pcurso'
                ],
                'RelationConstrain': {
                  '@pcurso': {
                    'Eje': 'EJECUTIVO',
                    'Pcl': 'PRIMERA CLASE'
                  }
                }
              }
            }
          }
        },
        'response': {}
      }
    });

db.providers.insert({
      'name': 'AMADEUS',
      'type': 'FLIGHTS',
      'integrationType': 'REST',
      'settings': {
        'request': {
          'parameters': {
            'methods': {
              'catalogue': {
                'BaseURL': 'https://test.api.amadeus.com',
                'APIMethod': 'v1/shopping/flight-destinations',
                'HttpVerbose': 'GET',
                'Header': {
                  'TokenHeader': true,
                  'HeaderParameters': {
                    'Content-Type': null
                  },
                  'MediaTypeHeader': null,
                  'TokenDefinition': {
                    'BaseURL': 'https://test.api.amadeus.com',
                    'APIMethod': 'v1/security/oauth2/token',
                    'HttpVerbose': 'POST',
                    'Header': {
                      'TokenHeader': false,
                      'HeaderParameters': {
                        'Content-Type': 'application/x-www-form-urlencoded'
                      },
                      'MediaTypeHeader': 'application/x-www-form-urlencoded',
                      'TokenDefinition': null,
                      'ResponseToken': {
                        'tokenTypeName': 'token_type',
                        'accessTokenName': 'access_token'
                      }
                    },
                    'Body': {
                      'BodyMediaType': 'application/x-www-form-urlencoded',
                      'BodyJsonMessage': null,
                      'BodyRawMessage': {
                        'grant_type': '@grant_type',
                        'client_id': '@client_id',
                        'client_secret': '@client_secret'
                      }
                    },
                    'Parameters': {
                      'Parameters': null
                    }
                  }
                },
                'Body': {
                  'BodyMediaType': null,
                  'BodyJsonMessage': null,
                  'BodyRawMessage': null
                },
                'Parameters': {
                  'Parameters': {
                    'origin': '@origin',
                    'oneWay': '@oneWay',
                    'nonStop': '@nonStop',
                    'viewBy': '@viewBy',
                    'departureDate': '@departureDate'
                  }
                }
              },
              'reserve': {}
            }
          }
        },
        'response': {}
      }
    });

db.providers.insert({
            'type': 'HOTELS',
            'name': 'ABC',
            'integrationType': 'DATABASE',
            'settings': {
                'request': {
                    'parameters': {
                        'endpoint': 'localhost:3306/MyBD',
                        'user': 'abcv',
                        'password': '234432',
                        'engineType': 'MYSQL',
                        'statements': {
                            'catalogue': 'SELECT * FROM HJKAS',
                            'reserve': 'INSERT INTO ASD ...'
                        }
                    }
                },
                'response': {}
            }
        });

db.providers.insert({
            'type': 'TRANSPORT',
            'name': 'BUSES S.A',
            'integrationType': 'DATABASE',
            'settings': {
                'request': {
                    'parameters': {
                        'endpoint': 'localhost:3306/MyBD',
                        'user': 'abcv',
                        'password': '234432',
                        'engineType': 'MYSQL',
                        'statements': {
                            'catalogue': 'SELECT * FROM HJKAS',
                            'reserve': 'INSERT INTO ASD ...'
                        }
                    }
                },
                'response': {}
            }
        });

db.providers.insert({
            'type': 'EVENTS',
            'name': 'CONCIERTOS ACVDE',
            'integrationType': 'FTP',
            'settings': {
                'request': {
                    'parameters': {
                        'endpoint': 'localhost',
                        'user': 'ASDSFDGFHGJ',
                        'password': 'ASDFGFH32443',
                        'path': 'pepito/',
                        'filename': 'miarchivo',
                        'delimeter': ','
                    }
                },
                'response': {

                }
            }
        });

db.providers.find();
